from math import sqrt


def solution(a, b, c):
    d = b**2 - 4*a*c
    if d < 0:
        return 'no solution'
    elif d == 0:
        return -b/2/a
    else:
        return (-b+sqrt(d))/2/a, (-b-sqrt(d))/2/a


def get_unique_names():
    mentors = [
        ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев",
         "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина", "Азамат Искаков",
         "Роман Гордиенко"],
        ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев",
         "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
         "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов",
         "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
        ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
         "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая", "Денис Ежков",
         "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
        ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
         "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
    ]

    all_list = []
    for m in mentors:
        all_list.extend(m)

    unique_names = set()
    for mentor in all_list:
        name, surname = mentor.split()
        unique_names.add(name)

    all_names_sorted = sorted(unique_names)

    return f'Уникальные имена преподавателей: {", ".join(all_names_sorted)}'


def course_duration(course_name):
    courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля",
               "Frontend-разработчик с нуля"]

    durations = [14, 20, 12, 20]

    courses_dict = {}
    for course, duration in zip(courses, durations):
        courses_dict[course] = duration

    return courses_dict.get(course_name)


if __name__ == '__main__':
    courses = ["Java-разработчик с нуля", "Fullstack-разработчик на Python", "Python-разработчик с нуля",
               "Frontend-разработчик с нуля"]

    durations = [14, 20, 12, 20]
    print([(course, duration) for course, duration in zip(courses, durations)])